tutorials/dbsFoam/flowOnly/heterogeneousPermeability/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu             mu  [ 1 -1 -1 0 0 0 0 ] 1e-3;
rho            rho   [ 1 -3 0 0 0 0 0 ] 1000;
nu             nu  [ 0 2 -1 0 0 0 0 ] 1e-6;


geochemicalProperties
{
 	geochemicalModel flowOnly;
	rhol            rhol [ 1 -3 0 0 0 0 0 ] 1000;

	 mineral (Calcite);

	 absolutePermeabilityModel heterogeneousScalarConstant;
	 heterogeneousScalarConstantCoeffs
	 {
		K0 K0 [0 2 0 0 0 0 0] 1e-11;
		updateFromInitialValue off;
	 }

	 dispersionModel none;

	 CalciteProperties
	 {
		activatePhaseEquilibrium false;
		rhos rhos [1 -3 0 0 0 0 0] 2707;
		Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
		surfaceAreaModel none;
	 }

}

// ************************************************************************* //
